tap "homebrew/bundle"
tap "homebrew/core"
if RUBY_PLATFORM[/darwin/]
  tap "caarlos0/tap"
  tap "dopplerhq/cli"
  tap "homebrew/autoupdate"
  tap "homebrew/cask"
  tap "homebrew/cask-drivers"
  tap "homebrew/cask-fonts"
  tap "homebrew/cask-versions"
  tap "homebrew/command-not-found"
  tap "homebrew/services"
  tap "homebrew/test-bot"
  tap "mas-cli/tap"
  tap "mongodb/brew"
  brew "ack"
  brew "asciidoctor"
  brew "bash"
  brew "bash-completion@2"
  brew "bat"
  brew "brew-cask-completion"
  brew "bundler-completion"
  brew "coreutils"
  brew "direnv"
  brew "duf"
  brew "exiftool"
  brew "fzf"
  brew "gem-completion"
  brew "gh"
  brew "gpg"
  brew "grc"
  brew "htop"
  brew "hyperfine"
  brew "jq"
  brew "ipython"
  brew "m-cli"
  brew "makeself"
  brew "mas"
  brew "most"
  brew "ncdu"
  brew "nmap"
  brew "openssh"
  brew "openjdk"
  brew "parallel"
  brew "pip-completion"
  brew "python@3.10", overwrite: true
  brew "qpdf"
  brew "rsync"
  brew "ruby-completion"
  brew "speedtest-cli"
  brew "starship"
  brew "telnet"
  brew "tor", restart_service: true
  brew "tree"
  brew "vim"
  brew "watchman"
  brew "wget"
  brew "whalebrew"
  brew "caarlos0/tap/svu"
  brew "dopplerhq/cli/doppler"
  brew "mongodb/brew/mongodb-community", restart_service: true
  cask "appcleaner"
  cask "adobe-acrobat-reader"
  cask "adoptopenjdk"
  cask "autofirma"
  cask "beardedspice"
  cask "docker"
  cask "electron"
  cask "electrum"
  cask "firefox-developer-edition"
  cask "font-archivo-black"
  cask "font-lato"
  cask "font-nova-mono"
  cask "font-share-tech"
  cask "font-share-tech-mono"
  cask "font-jetbrains-mono-nerd-font"
  cask "google-chrome-canary"
  cask "iterm2"
  cask "keepingyouawake"
  cask "opera-developer"
  cask "paintbrush"
  cask "skype"
  cask "slack"
  cask "spotify"
  cask "telegram-desktop"
  cask "tor-browser"
  cask "whatsapp"
  mas "Bear", id: 1091189122
  mas "HP Smart", id: 1474276998
  mas "Magnet", id: 441258766
  mas "WhatFont", id: 1437138382
end
